# Import

## Modules

In [2]:
import numpy as np
import pandas as pd

## Data

In [11]:
df = pd.DataFrame.from_dict({"date": pd.date_range('2015-02-24', periods=10, freq='D'),
                             "col1": np.random.randint(5, size=10), 
                             "col2": 100*np.random.randint(5, size=10),
                             "col3": np.random.randn(1, 10).squeeze()})

In [12]:
df

        date  col1  col2      col3
0 2015-02-24     4   200  0.966712
1 2015-02-25     1     0 -1.239591
2 2015-02-26     4     0 -2.138567
3 2015-02-27     3   400  1.792204
4 2015-02-28     3     0  1.726700
5 2015-03-01     2   200  0.903985
6 2015-03-02     3   400 -0.255214
7 2015-03-03     0   100  1.247975
8 2015-03-04     4   200 -0.313888
9 2015-03-05     4   300 -0.027013

# Problem Statement

Aggregate the previous data set according to day, week and month

# Solution

Set the date as the index of the data frame

In [13]:
df.set_index(pd.to_datetime(df["date"].dt.date), inplace=True)
df

                 date  col1  col2      col3
date
2015-02-24 2015-02-24     4   200  0.966712
2015-02-25 2015-02-25     1     0 -1.239591
2015-02-26 2015-02-26     4     0 -2.138567
2015-02-27 2015-02-27     3   400  1.792204
2015-02-28 2015-02-28     3     0  1.726700
2015-03-01 2015-03-01     2   200  0.903985
2015-03-02 2015-03-02     3   400 -0.255214
2015-03-03 2015-03-03     0   100  1.247975
2015-03-04 2015-03-04     4   200 -0.313888
2015-03-05 2015-03-05     4   300 -0.027013

Agregate by day

In [14]:
df['col1'].resample('D').sum().to_frame()

            col1
date
2015-02-24     4
2015-02-25     1
2015-02-26     4
2015-02-27     3
2015-02-28     3
2015-03-01     2
2015-03-02     3
2015-03-03     0
2015-03-04     4
2015-03-05     4

Agregate by week

In [15]:
df['col1'].resample('W').sum().to_frame()

            col1
date
2015-03-01    17
2015-03-08    11

Agregate by month

In [16]:
df['col1'].resample('M').sum().to_frame()

            col1
date
2015-02-28    15
2015-03-31    13

Agregate by week and by `co11`

In [20]:
df.groupby([pd.Grouper(freq='W'), 'col1']).count()

                 date  col2  col3
date       col1
2015-03-01 1        1     1     1
           2        1     1     1
           3        2     2     2
           4        2     2     2
2015-03-08 0        1     1     1
           3        1     1     1
           4        2     2     2